
"""
Ожидаемый вывод (примерно), хотя если точно, то будет супер.
(Внимание! Количество символов # не равняется числу справа,
а просто ориентировочно по формуле зависит от него.)

Mon: ##################### (30)
Tue: ###########__________ (15)
Wed: #____________________ ( 1)
Thu: #################____ (25)
Fri: ####_________________ ( 5)
Sat: ###################__ (28)
"""

subs = [30, 15, 1, 25, 5, 28]
days = ("Mon", "Tue", "Wed", "Thu", "Fri", "Sat")

max_day = max(subs)  # Самое максимальное значение из всех

i = 0
maximum = max(subs)
while i < len(days):
    procent = round(subs[i]/maximum * 25)
    c = 25 - procent
    print(f"{days[i]}: {procent * "#"}{c * "_"} {subs[i]:>2}")
    
    i += 1