# 1. [ ] Помыть посуду
# 2. [x] Сходить в магазин
# 3. [ ] Сделать ДЗ
# 4. [x] Позвонить кому-то

# Первая задача ------------------------------------------------------------------

tasks = ["Помыть посуду", "Сходить в магазин", "Сделать ДЗ", "Позвонить кому-то"]
done = [False, True, False, True]

for i in range(len(tasks)):
    if done[i] == False:
        print(f"{i+1}. [x] {tasks[i]}")
    else:
        print(f"{i+1}. [ ] {tasks[i]}")
# --------------------------------------------------------------------------------
print()
# Вторая задача ------------------------------------------------------------------

tasks_1 = [
    ["Помыть посуду", False],
    ["Сходить в магазин", True],
    ["Сделать ДЗ", False],
    ["Позвонить кому-то", True]
]

for i in range(len(tasks_1)):
    if tasks_1[i][1] == False:
        print(f"{i+1}. [x] {tasks[i]}")
    else:
        print(f"{i+1}. [ ] {tasks[i]}")
print()

#  или ---------------------------------------------------------------------------

for task, status in zip(tasks, done):
    if status:
        mark = "[x]"
    else:
        mark = "[ ]"
    print(f"{mark} {task}")